//=====================================
//
//ゲームシーン処理[GameScene.cpp]
//Author:GP12A332 21 立花雄太
//
//=====================================
#include "GameScene.h"
#include "Framework/ResourceManager.h"
#include "camera.h"
#include "light.h"

/**************************************
マクロ定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
初期化処理
***************************************/
void GameScene::Init()
{
	ResourceManager::Instance()->LoadTexture("enemy01", "data/bullet001.png");

	enemy = new Enemy;
}

/**************************************
終了処理
***************************************/
void GameScene::Uninit()
{
	delete enemy;
}

/**************************************
更新処理
***************************************/
void GameScene::Update(HWND hWnd)
{
	enemy->UpdateEnemy();
}

/**************************************
描画処理
***************************************/
void GameScene::Draw()
{
	enemy->DrawEnemy();
}
