//=====================================
//
//リザルトシーン処理[ResultScene.cpp]
//Author:GP12A332 21 立花雄太
//
//=====================================
#include "ResultScene.h"
#include "Result.h"

/**************************************
マクロ定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
初期化処理
***************************************/
void ResultScene::Init()
{
	InitResult(0);
}

/**************************************
終了処理
***************************************/
void ResultScene::Uninit()
{
	UninitResult();
}

#include "Game.h"
#include "input.h"
/**************************************
更新処理
***************************************/
void ResultScene::Update(HWND hWnd)
{
	if (GetAttackButtonTrigger())
		ChangeScene(SceneTitle);
}

/**************************************
描画処理
***************************************/
void ResultScene::Draw()
{
	DrawResult();
}
